; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-52)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 - object)
 (:init 
    (arm-empty)
    (clear b7)
    (on b7 b5)
    (on b5 b9)
    (on b9 b13)
    (on b13 b11)
    (on b11 b1)
    (on b1 b2)
    (on b2 b14)
    (on b14 b12)
    (on b12 b4)
    (on b4 b15)
    (on b15 b10)
    (on b10 b6)
    (on-table b6)
    (clear b8)
    (on b8 b3)
    (on-table b3))
 (:goal (and 
(on-table b11)
))
)

; plan
1. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 0 of 1
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
3. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 0 of 1
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
5. (unstack b9 b13)
   deleted: (on b9 b13) (clear b9) (arm-empty)
   added: (holding b9) (clear b13)
   goals met: 0 of 1
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
7. (unstack b13 b11)
   deleted: (on b13 b11) (clear b13) (arm-empty)
   added: (holding b13) (clear b11)
   goals met: 0 of 1
8. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
9. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 0 of 1
10. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 1
